{
  "backend/main.mo": "Main Motoko actor implementing a salad bowl business management system with authorization, inventory tracking, product/recipe management, invoicing, customer profiles, subscriptions, orders, and stock transactions.",
  "feature_evidence.json": "Feature evidence report documenting four authentication and UI flickering issues related to Internet Identity login, page re-rendering, and redirect loops in the admin panel.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files covering routing, authentication, admin pages (dashboard, inventory, products, billing, subscriptions, reports), components, and utility functions.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point that loads the React application from /src/main.tsx into a root div element.",
  "frontend/README.md": "Documentation explaining the application's Internet Identity authentication flow, feature set, technology stack, and instructions for first-time users and login procedures.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with admin routes (protected by Internet Identity) and user routes (protected by CustomerAuth), wrapped with QueryClient, CartProvider, and CustomerAuthProvider.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Renders warning cards with counts and details for each alert type.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, multiple product line items, payment mode selection, and discount calculation. Uses mock product data and includes auto-price filling when products are selected.",
  "frontend/src/components/CartDrawer.tsx": "Side drawer component displaying shopping cart items with quantity controls, item removal, and checkout navigation. Shows empty state when cart is empty.",
  "frontend/src/components/CustomerForm.tsx": "Form for adding new customers with fields for name, phone, email, address, and preferences. Uses useAddCustomer hook to persist data to backend.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for bulk selection and individual message sending actions. Handles loading and empty states.",
  "frontend/src/components/CustomerLoginButton.tsx": "Button component that toggles customer authentication state, showing login/logout with appropriate icons and handling authentication flow with query cache clearing.",
  "frontend/src/components/CustomerProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login page and shows loading screen during authentication initialization.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and expenses in card format. Fetches data using useAnalyticsMetrics hook with loading states.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Uses form validation and mutation hook to update ingredient data.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl product details including name, bowl size, price, and active status. Includes bowl size selection from available sizes and uses mutation hook to update product.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management. Allows adding/removing ingredients with quantities and validates before saving via mutation hook.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, dates, payment status, and remaining deliveries. Auto-calculates end date based on plan duration and start date.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, supplier, quantity, cost price, and low stock threshold. Validates numeric inputs and resets form on successful submission.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of ingredients with quantity, cost, supplier, and low-stock alerts. Supports editing and deleting ingredients with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Shows a table of recent invoices with customer details, items, payment mode, and date. Currently uses mock data with a TODO to integrate backend.",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket (KOT) listing active subscription plans with customer names, bowl sizes, and remaining deliveries.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with navigation sidebar, authentication checks, and logout functionality. Redirects unauthenticated users to login page.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog for sending bulk notifications to selected customers. Displays recipient badges and a message textarea with character count.",
  "frontend/src/components/OrderStatusDropdown.tsx": "Dropdown select component for changing order status (pending, preparing, ready, delivered) with confirmation dialog before updating.",
  "frontend/src/components/OrderStatusTimeline.tsx": "Visual timeline component showing order progress through four stages with icons and connecting lines, highlighting the current status.",
  "frontend/src/components/ProductDetailDialog.tsx": "Dialog component displaying detailed product information including image, bowl size, price, ingredients, and quantity selector with add-to-cart functionality.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating new salad bowl products with fields for name, bowl type, price, and dynamic recipe ingredients list.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit/delete actions, and dialogs for editing recipes and product details.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component showing mock sales and profit data in daily, weekly, and monthly views using line and bar charts.",
  "frontend/src/components/StockInTab.tsx": "Form for recording incoming stock with ingredient selection, quantity, supplier, and cost price fields, plus transaction history table.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording stock-out transactions with ingredient selection, quantity validation, and reason input. Displays a table of historical stock-out transactions.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, and provides actions to add, edit, or delete ingredients with confirmation dialogs.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with formatted timestamps, transaction type badges, and detailed transaction information.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating new subscriptions with customer details, plan type selection, bowl size, pricing, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Grid display of subscription cards showing customer details, plan status, expiration warnings, and actions to edit or delete subscriptions with confirmation dialogs.",
  "frontend/src/components/UserLayout.tsx": "Customer-facing layout wrapper with sticky header navigation, mobile menu sheet, cart drawer integration, and authentication-aware menu items.",
  "frontend/src/components/UserMenuSection.tsx": "Displays a grid of active salad bowl products with images, prices, and 'Add to Cart' buttons. Handles loading states, empty states, and integrates with cart context and product queries.",
  "frontend/src/components/UserOrdersSection.tsx": "Shows a customer's order history with order details including items, delivery address, payment mode, status badges, and timestamps. Fetches orders based on the logged-in user's customer ID.",
  "frontend/src/components/UserProfileSection.tsx": "Provides a form for users to view and edit their profile including contact info, dietary preferences, and health metrics (gender, age, height, weight). Calculates and displays BMI with validation.",
  "frontend/src/components/WriteOffTab.tsx": "Admin component for recording inventory write-offs with ingredient selection, quantity input, and reason. Displays a table of past write-off transactions.",
  "frontend/src/contexts/CartContext.tsx": "React context providing shopping cart functionality with add, update, remove, and clear operations. Persists cart state to sessionStorage and calculates order totals.",
  "frontend/src/contexts/CustomerAuthContext.tsx": "React context wrapping Internet Identity authentication for customer login/logout. Provides authentication state, identity, and login status to child components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with proper identity and authentication. Invalidates dependent queries when the actor changes due to identity updates.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity storage, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, orders, subscriptions, recipes, ingredients, stock management, and user profiles with mutations for CRUD operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (fresh green and warm orange theme), dark mode support, mobile-friendly touch targets, and print styles optimized for kitchen order tickets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient for data fetching and InternetIdentityProvider for authentication context.",
  "frontend/src/pages/BillingPage.tsx": "Admin page with tabbed interface for creating new invoices via BillingForm and viewing invoice history through InvoiceList component.",
  "frontend/src/pages/CheckoutPage.tsx": "Customer checkout page with order summary, delivery form validation (name, phone, address), payment mode selection, and order submission that clears cart and navigates to confirmation.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Customer-facing login page that uses Internet Identity authentication with feature highlights and auto-redirects authenticated users to dashboard.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication check, allowing admins to view, add, select customers, and send bulk or individual notifications via dialogs.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, metrics overview, and sales/profit trends chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Admin login page using Internet Identity for passwordless authentication with biometric support, redirecting to dashboard on success.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated preparation time, and navigation options to track order or return to menu.",
  "frontend/src/pages/OrdersPage.tsx": "Admin orders page displaying all orders in an expandable table with status management, customer details, and order item breakdowns.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Public order tracking page allowing users to search orders by phone number or order ID and view order details with status timeline.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page for admins to view, add, and manage salad bowl products and their recipes via a dialog form.",
  "frontend/src/pages/ReportsPage.tsx": "Displays exportable reports (inventory, sales, subscriptions, expenses) with CSV export functionality using mock data. Each report card shows an icon, description, and export button.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages subscription plans with a list view, add subscription dialog, and KOT (Kitchen Order Ticket) print functionality. Includes header with action buttons for adding subscriptions and printing.",
  "frontend/src/pages/UserDashboardPage.tsx": "User-facing dashboard with three tabs (Profile, Menu, Orders) that render respective section components. Provides navigation between user profile management, menu browsing, and order tracking.",
  "frontend/src/pages/UserMenuPage.tsx": "Public menu page displaying available salad bowls with hero banner, product cards showing images/prices/sizes, and product detail dialog. Fetches active products and maps bowl types to images and labels.",
  "frontend/src/utils/bmiCalculator.ts": "Utility functions for BMI calculation from height/weight, categorization (Underweight/Normal/Overweight/Obese), and color coding for display purposes.",
  "frontend/src/utils/csvExport.ts": "Provides CSV export functions for sales and inventory data, formatting rows with headers and triggering browser downloads with timestamped filenames.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens and cleanup functions to remove sensitive data from URLs.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette using OKLCH color space (fresh/warm themes), extended utilities for borders/shadows, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file tracking a full-stack salad business web application with admin panel (inventory, products, billing, subscriptions, analytics) and customer ordering interface. Documents 6 known issues including non-functional edit/delete operations, admin login problems, and UI flickering."
}