{
  "backend/main.mo": "Main Motoko actor implementing a salad bowl business management system with authorization, inventory tracking, product/recipe management, invoicing, customer profiles with health metrics (BMI), subscriptions, orders, and stock transactions.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend components, pages, and utilities including authentication, inventory, products, billing, subscriptions, reports, and CSV export functionality.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes including colors for UI components, charts, and sidebar elements.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Documentation for the Salad Khatora business management system explaining Internet Identity authentication flow, features (dashboard, inventory, products, billing, subscriptions, customers, reports), and technology stack.",
  "frontend/src/App.tsx": "Main React application with TanStack Router configuration defining admin routes (with Internet Identity protection) and user routes (with customer authentication and cart context), plus QueryClient setup.",
  "frontend/src/components/AlertPanel.tsx": "Alert panel component displaying mock low stock warnings and expiring subscription notifications with placeholder comment for future email integration.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, multiple product line items, payment mode selection, and discount calculation. Currently uses hardcoded product data with TODOs for backend integration.",
  "frontend/src/components/CartDrawer.tsx": "Side drawer component displaying cart items with quantity controls, item removal, and checkout navigation. Shows empty state when cart is empty and calculates total price.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with fields for name, phone, email, address, and preferences. Includes email validation and uses the useAddCustomer mutation hook.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for bulk selection and individual message sending actions. Shows loading and empty states.",
  "frontend/src/components/CustomerLoginButton.tsx": "Button component handling customer authentication (login/logout) with Internet Identity, managing login state and clearing query cache on logout.",
  "frontend/src/components/CustomerProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login page and shows loading screen during authentication initialization.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard widget displaying key business metrics (daily/weekly/monthly sales, cash flow, expenses) in card format with icons. Fetches data using useAnalyticsMetrics hook.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Uses form validation and the useUpdateIngredient hook to persist changes.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl product details including name, bowl size, price, and active status. Integrates with useBowlSizes and useUpdateProduct hooks for data management.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for modifying product recipes by adding/removing ingredients and adjusting quantities. Uses useEditRecipe hook to save recipe changes with validation.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, dates, payment status, and remaining deliveries. Auto-calculates end dates based on plan duration and uses useEditSubscription hook.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, supplier, quantity, cost price, and low stock threshold. Uses useAddIngredient hook and resets form on successful submission.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of ingredients with quantity, cost, supplier, and low-stock alerts. Supports editing and deleting ingredients with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Shows a table of recent invoices with customer details, items, payment mode, and date. Currently uses mock data pending backend integration.",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket listing active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with navigation sidebar, authentication checks, and logout functionality. Redirects unauthenticated users to login page.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog for sending bulk notifications to selected customers with a message textarea and recipient badge list.",
  "frontend/src/components/OrderStatusDropdown.tsx": "Dropdown select component for updating order status (pending, preparing, ready, delivered) with confirmation dialog before changes.",
  "frontend/src/components/OrderStatusTimeline.tsx": "Visual timeline component showing order progress through four stages with icons and completion indicators.",
  "frontend/src/components/ProductDetailDialog.tsx": "Dialog component displaying detailed product information including image, bowl size, price, ingredients, and quantity selector with add-to-cart functionality.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating new salad bowl products with fields for name, bowl type, price, and dynamic recipe ingredients list.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit/delete actions, and dialogs for editing recipes and product details.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component showing sales and profit data with daily, weekly, and monthly views using line and bar charts (currently using mock data).",
  "frontend/src/components/StockInTab.tsx": "Form and table for recording incoming stock transactions with ingredient selection, quantity, supplier, and cost price fields, plus transaction history display.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording stock-out transactions with ingredient selection, quantity validation, and reason input. Displays a table of historical stock-out transactions using StockTransactionTable.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, edit/delete actions per ingredient, and a dialog to add new ingredients. Includes confirmation dialogs for deletion.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date, showing ingredient name, quantity, type badges (Stock In/Out/Write Off), reason, supplier, and cost price.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating new subscriptions with customer details, plan type (weekly/monthly), bowl size selection, pricing, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Grid display of subscription cards showing customer info, plan details, expiry status with badges, and edit/delete actions. Includes expiry warnings and confirmation dialogs.",
  "frontend/src/components/UserLayout.tsx": "Customer-facing layout wrapper with sticky header, navigation menu (Menu, Track Order, Dashboard), cart drawer integration, and mobile-responsive sheet menu.",
  "frontend/src/components/UserMenuSection.tsx": "Displays the customer-facing menu of active salad bowls with images, prices, and 'Add to Cart' functionality. Handles loading states and empty menu scenarios.",
  "frontend/src/components/UserOrdersSection.tsx": "Shows a customer's order history with order details including items, delivery address, payment mode, status badges, and timestamps. Displays loading and empty states appropriately.",
  "frontend/src/components/UserProfileSection.tsx": "Provides a form for customers to view and edit their profile including contact info, dietary preferences, and health metrics (gender, age, height, weight). Calculates and displays BMI with validation.",
  "frontend/src/components/WriteOffTab.tsx": "Admin interface for recording inventory write-offs with ingredient selection, quantity input, and reason. Displays historical write-off transactions in a table.",
  "frontend/src/contexts/CartContext.tsx": "React context providing shopping cart state management with add, update, remove, clear operations and total calculation. Persists cart data to sessionStorage.",
  "frontend/src/contexts/CustomerAuthContext.tsx": "React context wrapping Internet Identity authentication for customers, providing login/logout functions and authentication status. Exposes identity and initialization state to child components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Initializes access control with admin token and invalidates dependent queries when actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, orders, subscriptions, inventory, recipes, and user profiles with mutations and cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (fresh green and warm orange theme), dark mode support, mobile-friendly touch targets, and print styles optimized for kitchen order tickets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/BillingPage.tsx": "Billing page with tabbed interface for creating new invoices and viewing invoice history using BillingForm and InvoiceList components.",
  "frontend/src/pages/CheckoutPage.tsx": "Customer checkout page with order summary, delivery form validation (name, phone, address), payment mode selection, and order submission that clears cart and navigates to confirmation.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Customer-facing login page that uses Internet Identity authentication with feature highlights and redirects authenticated users to their dashboard.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication check, displaying a list of customers with bulk selection, individual/bulk notification sending, and an add customer form.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, dashboard metrics, and sales/profit trends chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Admin login page using Internet Identity authentication with passwordless, biometric-supported secure login and automatic redirect after successful authentication.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated preparation time, and navigation options to track order or return to menu.",
  "frontend/src/pages/OrdersPage.tsx": "Admin orders page displaying all orders in an expandable table with status management, customer details, and order item breakdown.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Public order tracking page allowing users to search orders by phone number or order ID and view order status timeline and details.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with a dialog-based form to add new salad bowls and a list displaying existing products.",
  "frontend/src/pages/ReportsPage.tsx": "Displays exportable reports (inventory, sales, subscriptions, expenses) with mock data and CSV export functionality. Each report card shows an icon, description, and export button.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer subscriptions with a dialog form for adding new subscriptions, a list view, and a KOT (Kitchen Order Ticket) print feature.",
  "frontend/src/pages/UserDashboardPage.tsx": "User-facing dashboard with three tabs (Profile, Menu, Orders) that render respective section components for customer self-service.",
  "frontend/src/pages/UserMenuPage.tsx": "Public menu page displaying active salad bowl products with hero banner, product cards showing images/prices by bowl size, and a detail dialog for product selection.",
  "frontend/src/utils/bmiCalculator.ts": "Utility functions to calculate BMI from height and weight, categorize BMI values (underweight/normal/overweight/obese), and return appropriate color codes.",
  "frontend/src/utils/csvExport.ts": "Provides functions to export sales and inventory data to CSV files with proper headers, formatting, and automatic download triggers.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities supporting hash-based routing, with functions to extract, persist, and clear parameters from URL and sessionStorage, including sensitive data cleanup.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (fresh/warm themes), OKLCH color space, container settings, extended utilities, and animation keyframes for accordion components.",
  "project_state.json": "Project state file tracking a full-stack salad business web application with admin panel (inventory, billing, analytics, subscriptions) and customer ordering interface. Documents 7 known issues including non-functional admin login, broken edit/delete operations, and UI flickering problems."
}