{
  "backend/main.mo": "Main Motoko actor implementing a salad bowl business management system with inventory tracking, product recipes, invoicing, subscriptions, stock transactions, and analytics functions for sales and expenses.",
  "backend/migration.mo": "Migration module that transforms old actor state to new actor state by adding a 'unitType' field (defaulting to 'gram') to ingredient inventory records.",
  "feature_evidence.json": "Feature evidence report documenting implemented inventory management features including tabbed interface (Stock In, Stock Out, Write Off, Stock Status) with associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including pages, components, hooks, and utilities for the Salad Khatora business management application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining color schemes and design tokens for both light and dark themes using OKLCH color space.",
  "frontend/index.html": "HTML entry point for the Salad Khatora application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for all pages (dashboard, inventory, products, billing, subscriptions, reports, customers), React Query client, Internet Identity provider, and toast notifications.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Renders warning cards with counts and details for each alert type.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, multiple product line items, payment mode selection, and discount calculation. Uses mock product data and includes TODO for backend integration.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with name, contact details, and preferences fields. Uses useAddCustomer hook to persist data to backend.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection, showing ID, name, contact details, and preferences. Handles loading and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and daily expenses in card format. Fetches data using useAnalyticsMetrics hook with loading state handling.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Uses useUpdateIngredient hook for persistence.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing product details including name, bowl size, price, and active status. Uses useUpdateProduct hook and fetches available bowl sizes from backend.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing salad bowl recipes, allowing users to add/remove ingredients with quantities and save changes via the useEditRecipe mutation hook.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, pricing, payment status, and date ranges with auto-calculated end dates based on plan duration.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients to inventory with fields for name, quantity, cost per unit, supplier, and low stock threshold, using the useAddIngredient mutation hook.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of all ingredients with inventory details, total value calculation, low stock warnings, and actions for editing/deleting ingredients with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Displays a table of recent invoices with mock data including customer details, items, totals, payment modes, and dates (backend integration pending).",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket (KOT) view showing active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries in a formatted table.",
  "frontend/src/components/Layout.tsx": "Main layout component providing navigation header with mobile menu, desktop nav items (Dashboard, Inventory, Products, Billing, Subscriptions, Customers, Reports), authentication state handling, and logout functionality.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending notifications to selected customers, displaying recipient badges and a message textarea with character count and send functionality (currently simulated).",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new salad bowl products with fields for name, bowl type, price, and dynamic recipe ingredients list with add/remove functionality.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit recipe/product dialogs, and delete confirmation; uses React Query hooks for product CRUD operations.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component displaying sales and profit data in daily (line), weekly (bar), and monthly (line) views using Recharts with mock data placeholders.",
  "frontend/src/components/StockInTab.tsx": "Form and table component for recording stock-in transactions with ingredient selection, quantity, supplier, cost price inputs, and displays historical stock-in transactions.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording stock-out transactions with ingredient selection, quantity validation against available stock, and reason input. Displays a table of all stock-out transactions.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, includes add/edit/delete actions for ingredients, and shows low-stock alerts.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with formatted timestamps, transaction type badges, and all transaction details including supplier and cost.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating new subscriptions with customer details, plan type (weekly/monthly), bowl size selection, auto-calculated end dates, and payment status tracking.",
  "frontend/src/components/SubscriptionList.tsx": "Grid display of subscription cards showing customer info, plan details, expiration status with warnings for expiring subscriptions, and edit/delete actions.",
  "frontend/src/components/WriteOffTab.tsx": "Form component for recording inventory write-offs with ingredient selection, quantity validation, reason requirement, and displays a table of all write-off transactions.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication using Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for fetching and mutating backend data including analytics, products, customers, subscriptions, recipes, ingredients, stock transactions, and invoices with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for a salad business (fresh greens, warm oranges), dark mode support, mobile-friendly touch targets, and print styles for KOT (Kitchen Order Tickets).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Page component with tabs for creating new invoices and viewing invoice history, using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with list view, add customer form, bulk selection, and notification sending functionality for selected customers.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, business metrics, and sales/profit trend charts.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations for ingredient tracking.",
  "frontend/src/pages/LoginPage.tsx": "Login page component that uses Internet Identity for authentication, displays a branded card with Salad Khatora branding, and redirects authenticated users to the home page.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page that displays a list of products and provides a dialog-based form to add new salad bowl products with recipes.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page that allows exporting inventory, sales, subscriptions, and expenses data to CSV files with mock data placeholders for backend integration.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page that displays subscription list, provides a dialog form to add new subscriptions, and includes KOT (Kitchen Order Ticket) print functionality.",
  "frontend/src/utils/csvExport.ts": "Utility module providing functions to export sales and inventory data to CSV format with proper formatting and automatic download.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes (fresh, warm, chart colors), container settings, border radius variables, animations, and typography plugins for the application's design system.",
  "project_state.json": "Project state document tracking implemented features, architectural decisions, known issues (logo loading, edit/delete functionality for products and inventory), and comprehensive feature list for the Salad Khatora business management system."
}