{
  "backend/main.mo": "Main Motoko actor defining types (Ingredient, SaladBowl, Invoice, Subscription, Customer) and business logic for inventory management, sales tracking, subscription handling, analytics calculations, and CRUD operations with stable storage maps.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: edit functionality for inventory items (REQ-27) and delete functionality with confirmation dialog (REQ-28), both with high confidence.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend React components, pages, hooks, and utilities including dashboard, inventory, products, billing, subscriptions, reports, and customer management features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including sidebar, charts, and semantic tokens.",
  "frontend/index.html": "HTML entry point for the Salad Khatora application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for all pages (dashboard, login, inventory, products, billing, subscriptions, reports, customers), React Query client, Internet Identity provider, and toast notifications.",
  "frontend/src/components/AlertPanel.tsx": "Alert panel component displaying low stock ingredient warnings and expiring subscription notifications using mock data with placeholder for future email notification integration.",
  "frontend/src/components/BillingForm.tsx": "Invoice creation form with dynamic product selection, quantity/price calculation, discount support, and itemized order management; currently uses mock product data with TODO for backend integration.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with name, contact details, and preferences fields. Uses React Hook Form state and mutation hook to submit customer data with auto-generated BigInt ID.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection. Shows customer ID, name, contact details, and preferences with loading and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and daily expenses in card format. Fetches analytics data and formats currency values in Indian Rupees.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Validates numeric inputs and uses mutation hook to update ingredient.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl products with fields for name, bowl size selection, price, and active status. Handles bowl type enum conversion and product updates.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management. Allows adding/removing ingredients with quantities and validates before saving recipe updates.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, pricing, payment status, and date range. Auto-calculates end date based on plan duration and start date.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, quantity, cost per unit, supplier name, and low stock threshold. Validates numeric inputs and uses the useAddIngredient mutation hook to persist data.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of all ingredients with total inventory value, low stock warnings, and actions for editing/deleting. Includes confirmation dialogs for deletion and integrates with EditIngredientDialog component.",
  "frontend/src/components/InvoiceList.tsx": "Displays a table of recent invoices with mock data including customer details, items, payment mode, and dates. Currently uses placeholder data with a TODO to integrate actual backend data.",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket (KOT) view showing active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries. Filters out expired subscriptions.",
  "frontend/src/components/Layout.tsx": "Main application layout component with responsive navigation sidebar, header with logo, and authentication-aware routing. Includes mobile menu sheet and logout functionality using Internet Identity.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending notifications to selected customers with a message textarea and recipient badges. Currently simulates sending with a TODO to implement actual backend integration.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating new salad bowl products with name, bowl type, price, and recipe ingredients. Includes validation and submission handling with toast notifications.",
  "frontend/src/components/ProductList.tsx": "Displays a grid of product cards with availability toggles, edit/delete actions, and recipe management. Includes dialogs for editing products/recipes and confirmation for deletion.",
  "frontend/src/components/SalesChart.tsx": "Renders sales and profit charts with daily, weekly, and monthly views using recharts. Currently uses mock data with TODO to integrate backend data.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating customer subscriptions with plan type (weekly/monthly), bowl size, dates, and payment status. Auto-calculates end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards with customer details, status badges, expiration warnings, and edit/delete actions. Includes confirmation dialog for deletion.",
  "frontend/src/hooks/useActor.ts": "Custom hook that manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, subscriptions, invoices, ingredients, and recipes with mutations for CRUD operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using a fresh green and warm orange color palette, plus print styles for Kitchen Order Tickets (KOT).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the main App component.",
  "frontend/src/pages/BillingPage.tsx": "Displays billing interface with tabs for creating new invoices and viewing invoice history using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with list view, bulk selection, add customer form, and notification sending functionality for selected customers.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard displaying a hero banner, alert panel, business metrics, and sales/profit trend charts for the salad business.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with ingredient list and dialog-based form for adding new ingredients to track stock levels.",
  "frontend/src/pages/LoginPage.tsx": "Authentication page with Internet Identity login button, branding, and automatic redirect to dashboard after successful login.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with a dialog to add new salad bowls via ProductForm and displays existing products using ProductList component.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page that exports inventory, sales, subscriptions, and expenses data to CSV files with mock data placeholders for backend integration.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page with dialog for adding subscriptions and a print KOT (Kitchen Order Ticket) feature for subscription orders.",
  "frontend/src/utils/csvExport.ts": "Utility functions to export sales and inventory data to CSV format with proper headers and data formatting.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes (fresh, warm), OKLCH color system, container settings, and animation keyframes for the UI.",
  "project_state.json": "Project state document tracking features, architecture, and known issues including non-functional edit/delete operations for products and inventory items."
}