{
  "backend/main.mo": "Main Motoko actor implementing a salad bowl business management system with inventory, products, invoices, customers, orders, subscriptions, stock transactions, and role-based access control using MixinAuthorization.",
  "feature_evidence.json": "Feature evidence report documenting three high-confidence features related to debugging and resolving continuous flickering and auto-reloading issues in the admin page Layout component and router configuration.",
  "frontend-file-summaries.txt": "Pre-generated summaries of frontend files describing React components, pages, and utilities for the Salad Khatora business management application with Internet Identity authentication.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables defining light and dark theme color schemes for the application UI including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Documentation for the Salad Khatora business management system explaining Internet Identity authentication flow, features, technology stack, and how users create and use their blockchain-based identities.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with admin and user routes, Internet Identity authentication, protected route wrappers using refs to prevent redirect loops, and context providers for query client, cart, and customer auth.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Renders warning cards with counts and details for each alert type.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, multiple product line items, payment mode selection, and discount calculation. Uses mock product data and includes auto-price filling when products are selected.",
  "frontend/src/components/CartDrawer.tsx": "Side drawer component displaying shopping cart items with quantity controls, item removal, and checkout navigation. Shows empty state when cart is empty and calculates total price.",
  "frontend/src/components/CustomerForm.tsx": "Form for adding new customers with fields for name, phone, email, address, and preferences. Includes email validation and uses the useAddCustomer mutation hook.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection and individual message sending actions. Shows loading and empty states appropriately.",
  "frontend/src/components/CustomerLoginButton.tsx": "Button component handling customer authentication login/logout with Internet Identity. Manages login status states and clears query cache on logout.",
  "frontend/src/components/CustomerProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login page. Shows loading screen during authentication initialization.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and expenses with icons and color coding. Fetches data using useAnalyticsMetrics hook and formats currency values.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, quantity, cost price, supplier, and low stock threshold. Uses form validation and mutation hook to update ingredient data.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl product details including name, bowl size, price, and active status. Provides dropdown selection for available bowl sizes and uses mutation hook to update product.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management. Allows adding/removing ingredients with quantities and validates all fields before saving via mutation hook.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, dates, and payment status. Auto-calculates end date based on plan duration and start date.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, quantity, cost price, supplier, and low stock threshold. Validates numeric inputs and resets form on successful submission.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of ingredients with total inventory value, low-stock alerts, and actions to edit or delete ingredients. Includes confirmation dialogs for deletion and integrates with backend queries for CRUD operations.",
  "frontend/src/components/InvoiceList.tsx": "Renders a table of recent invoices with mock data, showing customer details, items, totals, payment modes, and dates. Currently uses placeholder data with a TODO to integrate actual backend data.",
  "frontend/src/components/KOTPrintView.tsx": "Generates a printable Kitchen Order Ticket (KOT) view displaying active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries. Filters out expired subscriptions.",
  "frontend/src/components/Layout.tsx": "Provides the main application layout with navigation sidebar, header, authentication checks, and logout functionality. Handles routing protection and redirects unauthenticated users to login.",
  "frontend/src/components/NotificationDialog.tsx": "Modal dialog for sending bulk notifications to selected customers, displaying recipient badges and a message textarea. Currently simulates sending with a placeholder implementation.",
  "frontend/src/components/OrderStatusDropdown.tsx": "Dropdown component for updating order status (pending, preparing, ready, delivered) with color-coded badges and a confirmation dialog before applying changes.",
  "frontend/src/components/OrderStatusTimeline.tsx": "Visual timeline component showing order progress through four stages (placed, preparing, ready, delivered) with icons and progress indicators.",
  "frontend/src/components/ProductDetailDialog.tsx": "Dialog component displaying detailed product information including image, bowl size, price, ingredients, and quantity selector with add-to-cart functionality.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating new salad bowl products with fields for name, bowl type, price, and dynamic recipe ingredients list.",
  "frontend/src/components/ProductList.tsx": "Admin component displaying all products in a grid with controls for toggling availability, editing recipes/details, and deleting products.",
  "frontend/src/components/SalesChart.tsx": "Chart component with tabbed views (daily/weekly/monthly) displaying sales and profit data using line and bar charts with mock data.",
  "frontend/src/components/StockInTab.tsx": "Form and table component for recording incoming stock transactions with ingredient selection, quantity, supplier, and cost price fields.",
  "frontend/src/components/StockOutTab.tsx": "React component for recording stock-out transactions with form validation, ingredient selection, quantity checks, and transaction history display using StockTransactionTable.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, supports adding/editing/deleting ingredients via dialogs, and shows stock alerts.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays sorted stock transactions (stock-in, stock-out, write-off) with formatted dates, badges, and transaction details.",
  "frontend/src/components/SubscriptionForm.tsx": "Form component for creating subscriptions with auto-calculated end dates based on plan type (weekly/monthly), bowl size selection, and payment status tracking.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards in a grid with status badges (active/expired/expiring soon), supports editing and deletion with confirmation dialog.",
  "frontend/src/components/UserLayout.tsx": "Customer-facing layout wrapper with sticky header, mobile navigation drawer, cart button with item count, and authentication-aware navigation menu.",
  "frontend/src/components/UserMenuSection.tsx": "Displays the customer-facing menu of available salad bowls with product cards showing images, prices, and an 'Add to Cart' button. Fetches active products from the backend and handles adding items to the shopping cart with toast notifications.",
  "frontend/src/components/UserOrdersSection.tsx": "Shows a customer's order history with order details including items, delivery address, payment mode, status badges, and timestamps. Fetches orders based on the logged-in user's customer ID and displays them in expandable cards.",
  "frontend/src/components/UserProfileSection.tsx": "Provides a form for customers to view and edit their profile information including contact details, dietary preferences, and health metrics (gender, age, height, weight). Calculates and displays BMI with validation for all input fields.",
  "frontend/src/components/WriteOffTab.tsx": "Admin interface for recording inventory write-offs due to spoilage or damage, with a form to select ingredients, enter quantities and reasons. Displays a history table of all write-off transactions and validates stock availability before recording.",
  "frontend/src/contexts/CartContext.tsx": "React context provider managing shopping cart state with add, update, remove, and clear operations. Persists cart data to sessionStorage and provides total calculation functionality.",
  "frontend/src/contexts/CustomerAuthContext.tsx": "React context provider wrapping Internet Identity authentication for customer login/logout. Exposes authentication state, identity object, and login status to child components.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that creates and manages the backend actor instance based on authentication state. Automatically recreates the actor when identity changes and invalidates dependent queries, with optional admin token initialization.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, orders, subscriptions, inventory, recipes, and user profiles with mutations for CRUD operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (fresh green and warm orange theme), dark mode support, mobile-friendly touch targets, and print styles optimized for kitchen order tickets.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/pages/BillingPage.tsx": "Billing page with tabbed interface for creating new invoices and viewing invoice history using BillingForm and InvoiceList components.",
  "frontend/src/pages/CheckoutPage.tsx": "Customer checkout page with order summary, delivery form validation (name, phone, address), payment mode selection, and order submission that clears cart and navigates to confirmation.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Customer-facing login page that uses Internet Identity authentication with feature highlights and redirects authenticated users to their dashboard.",
  "frontend/src/pages/CustomersPage.tsx": "Admin page for managing customers with bulk selection, individual/bulk notification sending, and add customer form. Requires Internet Identity authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, metrics overview, and sales/profit trends chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Admin login page using Internet Identity authentication with passwordless, biometric-supported secure login.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page displaying order ID, estimated preparation time, and navigation to track order or return to menu.",
  "frontend/src/pages/OrdersPage.tsx": "Admin orders management page with expandable table view showing all orders, their details, and status update dropdown.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Customer-facing page to search and track orders by phone number or order ID, displaying order details and status timeline.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page for adding and listing salad bowls with a dialog-based product form.",
  "frontend/src/pages/ReportsPage.tsx": "Displays exportable reports (inventory, sales, subscriptions, expenses) with CSV export functionality using mock data. Each report card shows an icon, description, and export button.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer subscriptions with a list view, add subscription dialog, and KOT (Kitchen Order Ticket) print functionality. Includes header with action buttons for adding subscriptions and printing.",
  "frontend/src/pages/UserDashboardPage.tsx": "User-facing dashboard with three tabs (Profile, Menu, Orders) that display respective sections for managing user profile, browsing menu items, and tracking orders.",
  "frontend/src/pages/UserMenuPage.tsx": "Public menu page displaying available salad bowls with hero image, product cards showing bowl sizes (250gm/350gm/500gm), prices, and clickable product details dialog.",
  "frontend/src/utils/bmiCalculator.ts": "Utility functions for calculating BMI from height and weight, categorizing BMI values (Underweight/Normal/Overweight/Obese), and returning appropriate color codes for each category.",
  "frontend/src/utils/csvExport.ts": "Provides CSV export functions for sales and inventory data, formatting data into CSV format with headers and triggering browser downloads with timestamped filenames.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens across navigation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, including fresh/warm color palettes, dark mode support, and extended theme settings for the salad bowl application.",
  "project_state.json": "Project state file documenting a full-stack Salad Khatora business management application with admin panel (inventory, products, billing, analytics, subscriptions) and customer ordering interface. Lists known issues including logo loading failures, non-functional edit/delete buttons, admin authentication problems, and page flickering/auto-reload issues."
}