{
  "backend/main.mo": "Main Motoko actor defining types (Ingredient, SaladBowl, Invoice, Subscription, Customer) and business logic for inventory management, product recipes, billing, subscriptions, analytics, and sales reporting with ingredient deduction on sales.",
  "feature_evidence.json": "Feature evidence report documenting three completed features: fixing logo image path, implementing product edit functionality, and implementing product delete functionality with confirmation dialog.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend components, pages, hooks, and utilities describing the React application structure with TanStack Router, React Query, and shadcn/ui components for the Salad Khatora management system.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color system defining light and dark theme variables for UI components including sidebar, charts, and semantic color tokens.",
  "frontend/index.html": "HTML entry point for the Salad Khatora application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for all pages (dashboard, inventory, products, billing, subscriptions, reports, customers), React Query client, Internet Identity provider, and toast notifications.",
  "frontend/src/components/AlertPanel.tsx": "Alert panel component displaying mock low stock warnings and expiring subscription notifications with placeholder comment for future email integration.",
  "frontend/src/components/BillingForm.tsx": "Invoice creation form with dynamic product selection from available products, auto-price filling, quantity management, discount calculation, and subtotal/total computation with TODO for backend integration.",
  "frontend/src/components/CustomerForm.tsx": "A form component for adding new customers with fields for name, contact details, and preferences. Uses React hooks and mutations to submit customer data with auto-generated BigInt IDs.",
  "frontend/src/components/CustomerList.tsx": "Displays a table of customers with checkboxes for selection, showing ID, name, contact details, and preferences. Handles loading and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Displays key business metrics (daily/weekly/monthly sales, cash flow, daily expenses) in a grid of cards with icons. Fetches data from analytics API and formats currency in Indian Rupees.",
  "frontend/src/components/EditProductDialog.tsx": "A dialog component for editing existing salad bowl products, allowing updates to name, bowl size, price, and active status. Handles bowl type enum conversion and form validation.",
  "frontend/src/components/EditRecipeDialog.tsx": "A dialog for editing product recipes with dynamic ingredient/quantity pairs. Supports adding/removing ingredients and validates all fields before submitting to backend.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "A dialog for editing subscription details including customer info, plan type, bowl size, payment status, and dates. Auto-calculates end dates based on plan duration.",
  "frontend/src/components/IngredientForm.tsx": "A form component for adding ingredients with fields for name, quantity, unit type, cost price, supplier, and low stock threshold. Currently has placeholder backend integration.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of ingredients with mock data, showing quantity, cost, supplier, and stock status with low-stock alerts. Includes total inventory value calculation and edit/delete action buttons.",
  "frontend/src/components/InvoiceList.tsx": "Renders a table of recent invoices with mock data, displaying customer details, items ordered, payment mode, and date. Uses date-fns for date formatting.",
  "frontend/src/components/KOTPrintView.tsx": "Generates a printable Kitchen Order Ticket (KOT) view for active subscription plans, fetching data via useAllSubscriptions hook and displaying customer names, bowl sizes, and remaining deliveries.",
  "frontend/src/components/Layout.tsx": "Main application layout component with responsive navigation sidebar, header with logo, and authentication state management. Handles routing and logout functionality with Internet Identity integration.",
  "frontend/src/components/NotificationDialog.tsx": "Modal dialog for sending notifications to selected customers with a message textarea and recipient badges. Currently simulates sending with a TODO for backend integration.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding salad bowl products with bowl type selection, pricing, and dynamic recipe ingredient management. Includes add/remove ingredient functionality with validation.",
  "frontend/src/components/ProductList.tsx": "Displays a grid of salad bowl products with availability toggles, edit/delete actions, and recipe management. Uses React Query hooks to fetch products and handle mutations for toggling availability and deleting products.",
  "frontend/src/components/SalesChart.tsx": "Renders sales and profit charts with daily, weekly, and monthly views using Recharts. Currently uses mock data with a TODO comment indicating backend integration is pending.",
  "frontend/src/components/SubscriptionForm.tsx": "Form component for creating new subscriptions with fields for customer details, plan type (weekly/monthly), bowl size, pricing, and date selection. Auto-calculates end dates based on plan duration and uses React Query mutation to create subscriptions.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards in a grid with status badges (active/expired/expiring soon), customer details, and edit/delete actions. Uses React Query to fetch subscriptions and includes confirmation dialog for deletions.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Invalidates and refetches dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context and hooks for login/logout functionality. Manages AuthClient creation, identity state, and login status with support for delegation identity validation.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating data including analytics metrics, plan durations, bowl sizes, products, recipes, customers, subscriptions, invoices, ingredients, and notifications. Each hook uses the actor from useActor to interact with the backend canister.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using a fresh green and warm orange color palette suitable for a salad business. Includes print styles for Kitchen Order Tickets (KOT) and mobile-friendly touch target utilities.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Billing page with tabs for creating new invoices (BillingForm) and viewing invoice history (InvoiceList).",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with functionality to add customers, select multiple customers, and send bulk notifications. Displays CustomerList with selection checkboxes and integrates CustomerForm and NotificationDialog.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner with salad image, alert panel, dashboard metrics, and sales/profit trend chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with a dialog for adding new ingredients via IngredientForm and displaying all ingredients in IngredientList.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, featuring a branded card with Salad Khatora branding and automatic redirect to dashboard after successful login.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with a dialog for adding new salad bowls via ProductForm and displaying all products in ProductList.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page component that displays cards for different report types (inventory, sales, subscriptions, expenses) with export-to-CSV functionality using mock data for each report type.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscriptions management page with dialog forms for adding subscriptions, a list view component, and KOT (Kitchen Order Ticket) print functionality.",
  "frontend/src/utils/csvExport.ts": "Utility module providing CSV export functions for sales and inventory data, formatting data into CSV format and triggering browser downloads.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes (fresh, warm, chart colors), extended theme settings using OKLCH color space, and animation plugins.",
  "project_state.json": "Project metadata tracking implemented features, architectural decisions, and known issues including logo loading failure and non-functional edit/delete for products."
}