{
  "backend/main.mo": "Main actor implementing a salad business management system with inventory, products, orders, customers, subscriptions, invoicing, and analytics; integrates authorization via MixinAuthorization and data migration.",
  "backend/migration.mo": "Migration module that transforms OldCustomer records (with reference field) to NewCustomer records (without reference field) by mapping over the customers Map.",
  "feature_evidence.json": "Feature evidence report documenting four completed features: removing customer reference field, removing audible order notifications, removing UPI QR code generation, and restoring inventory navigation/routes.",
  "frontend-file-summaries.txt": "Summaries of frontend files describing React components, pages, hooks, and utilities for the admin panel including inventory, billing, customers, orders, and menu management.",
  "frontend/index.css": "Tailwind CSS configuration with custom OKLCH color variables for light and dark themes, defining design tokens for UI components.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Documentation for the Salad Khatora business management system explaining Internet Identity authentication flow, features, technology stack, and browser compatibility.",
  "frontend/src/App.tsx": "Root React component configuring TanStack Router with routes for login, customers, orders, billing, menu, and inventory pages; wraps app with QueryClientProvider.",
  "frontend/src/components/AlertPanel.tsx": "Component displaying low stock warnings and expiring subscription notifications with placeholder for email integration (note: content was truncated in input).",
  "frontend/src/components/BillingForm.tsx": "React form component for creating invoices with customer details, product selection, quantity management, and payment mode. Calculates totals and submits invoice data to the backend.",
  "frontend/src/components/BulkUploadDialog.tsx": "Dialog component for bulk uploading menu items via CSV file with template download, file parsing, validation preview, and progress tracking. Displays upload results and handles success/error states.",
  "frontend/src/components/CartDrawer.tsx": "Empty file with no content.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with personal details (name, phone, email, address), preferences, and health metrics (gender, age, height, weight). Calculates BMI automatically.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying all customers with their details and BMI, includes delete functionality with confirmation dialog. Shows loading state and empty state when no customers exist.",
  "frontend/src/components/CustomerLoginButton.tsx": "Empty file with no content.",
  "frontend/src/components/CustomerProtectedRoute.tsx": "Empty file with no content.",
  "frontend/src/components/DashboardMetrics.tsx": "Empty file with no content.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredients with fields for name, unit type, quantity, cost, supplier, and low stock threshold. Pre-populates form with current ingredient data.",
  "frontend/src/components/EditProductDialog.tsx": "Empty file with no content.",
  "frontend/src/components/EditRecipeDialog.tsx": "Empty file with no content.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Empty file with no content.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, unit type, quantity, low stock threshold, supplier, and cost price. Submits data using useAddIngredient mutation and resets form on success.",
  "frontend/src/components/IngredientList.tsx": "Empty file with no content.",
  "frontend/src/components/InvoiceList.tsx": "Displays a table of all invoices sorted by timestamp, showing date, customer name, ordered items, payment mode badges, and total price. Uses useAllInvoices query hook.",
  "frontend/src/components/KOTPrintView.tsx": "Empty file with no content.",
  "frontend/src/components/Layout.tsx": "Main layout component with sidebar navigation for admin panel, including authentication handling via Internet Identity, navigation items (Customers, Orders, Billing, Menu, Inventory), and logout functionality. Redirects unauthenticated users to login page.",
  "frontend/src/components/NotificationDialog.tsx": "Empty file with no content.",
  "frontend/src/components/OrderStatusDropdown.tsx": "Empty file with no content.",
  "frontend/src/components/OrderStatusTimeline.tsx": "Empty file with no content.",
  "frontend/src/components/ProductDetailDialog.tsx": "Empty file with no content.",
  "frontend/src/components/ProductForm.tsx": "Empty file with no content.",
  "frontend/src/components/ProductList.tsx": "Empty file with no content.",
  "frontend/src/components/SalesChart.tsx": "Empty file with no content.",
  "frontend/src/components/StockInTab.tsx": "Form for recording stock-in transactions with ingredient selection, quantity, supplier, cost price, and reason fields. Displays stock-in transaction history using StockTransactionTable component.",
  "frontend/src/components/StockOutTab.tsx": "Form for recording stock-out transactions with validation to prevent over-withdrawal. Shows available quantity for selected ingredient and displays stock-out transaction history.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with ingredient details, quantities, costs, and total value. Includes add/edit/delete functionality with IngredientForm and EditIngredientDialog, plus AlertDialog for delete confirmation.",
  "frontend/src/components/StockTransactionTable.tsx": "Displays a sortable table of stock transactions with date, ingredient, quantity, type badges (Stock In/Out/Write Off), reason, supplier, and cost price columns.",
  "frontend/src/components/SubscriptionForm.tsx": "Empty file with no content.",
  "frontend/src/components/SubscriptionList.tsx": "Empty file with no content.",
  "frontend/src/components/UPIQRCode.tsx": "Empty file with no content.",
  "frontend/src/components/UserLayout.tsx": "Empty file with no content.",
  "frontend/src/components/UserMenuSection.tsx": "Empty file with no content.",
  "frontend/src/components/UserOrdersSection.tsx": "Empty file with no content.",
  "frontend/src/components/UserProfileSection.tsx": "Empty file with no content.",
  "frontend/src/components/WriteOffTab.tsx": "Form for recording ingredient write-offs with validation against available stock, displays write-off transaction history, and resets form after submission.",
  "frontend/src/contexts/CartContext.tsx": "Empty file with no content.",
  "frontend/src/contexts/CustomerAuthContext.tsx": "Empty file with no content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages the backend actor with Internet Identity authentication, initializes access control with admin token, and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useOrderNotifications.ts": "Empty file with no content.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend operations including products, user profiles, customers, invoices, ingredients, stock transactions, and orders with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom fresh green and warm orange color palette for light/dark themes, mobile-friendly touch targets, and print styles optimized for kitchen order tickets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the App component.",
  "frontend/src/pages/BillingPage.tsx": "Tabbed page with 'New Invoice' form and 'Invoice History' list for creating and viewing billing records.",
  "frontend/src/pages/CheckoutPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Empty file with no content.",
  "frontend/src/pages/CustomersPage.tsx": "Protected admin page for customer management with authentication check, displays customer form and list after successful login.",
  "frontend/src/pages/DashboardPage.tsx": "Redirects unauthenticated users to login page and authenticated users to the customers page.",
  "frontend/src/pages/InventoryPage.tsx": "Main inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Admin login page using Internet Identity authentication with redirect to home after successful login.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Empty file with no content.",
  "frontend/src/pages/OrdersPage.tsx": "Displays all customer orders in a table with sorting by date, showing order details, status badges, and total amounts.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Empty file with no content.",
  "frontend/src/pages/ProductsPage.tsx": "Menu items management page with bulk CSV upload functionality and an alert indicating limited features.",
  "frontend/src/pages/ReportsPage.tsx": "Redirects to the customers page immediately on mount.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Redirects to the customers page immediately on mount.",
  "frontend/src/pages/UserDashboardPage.tsx": "Empty file with no content.",
  "frontend/src/pages/UserMenuPage.tsx": "Empty file with no content.",
  "frontend/src/utils/bmiCalculator.ts": "Empty file with no content.",
  "frontend/src/utils/csvExport.ts": "Empty file with no content.",
  "frontend/src/utils/csvParser.ts": "Parses CSV files to extract product data with validation for bowl types, nutritional values, and required fields.",
  "frontend/src/utils/upiQRGenerator.ts": "Empty file with no content.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, storing, and managing URL parameters and session storage, supporting both hash-based and browser-based routing.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes (fresh, warm), extended theme settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking document listing completed features including removal of customer reference field, order notifications, UPI QR codes, and restoration of inventory routes."
}