{
  "backend/main.mo": "Motoko actor implementing a salad bowl business management system with inventory tracking, product recipes, invoicing, subscriptions, customer management, stock transactions, and analytics functions for sales and expenses.",
  "feature_evidence.json": "Feature evidence report documenting three authentication-related features: router authentication enforcement in App.tsx, Layout component authentication checks, and admin Internet Identity credential documentation in README.md.",
  "frontend-file-summaries.txt": "Text file containing JSON summaries of all frontend source files including pages, components, hooks, and utilities with descriptions of their functionality and authentication integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes, defining colors for UI components including sidebar, charts, and semantic tokens like primary, secondary, muted, and destructive.",
  "frontend/index.html": "HTML entry point for the React application with viewport meta tag and a root div that loads the main TypeScript module.",
  "frontend/README.md": "Project documentation explaining Internet Identity authentication flow, application features, technology stack, and instructions for first-time users to create and use their Internet Identity for secure, passwordless access.",
  "frontend/src/App.tsx": "Main application component configuring TanStack Router with protected routes (dashboard, inventory, products, billing, subscriptions, reports, customers) wrapped in ProtectedRoute component that redirects unauthenticated users to /login, plus QueryClient provider and Internet Identity integration.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Includes TODO comments for future backend integration and email notification features.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, product selection, quantity, pricing, and payment mode. Uses mock product data and includes TODO for backend API integration.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with name, phone, email, address, and preferences fields. Uses useAddCustomer hook to persist customer data to backend.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection and individual message sending actions. Handles loading and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and expenses with icons. Fetches data using useAnalyticsMetrics hook and formats currency in Indian Rupees.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Uses useUpdateIngredient hook for backend updates.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl products with fields for name, bowl size, price, and active status. Handles form submission via useUpdateProduct mutation and displays validation errors.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management (add/remove/update). Validates ingredient fields and submits recipe updates via useEditRecipe mutation.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, pricing, payment status, and date range. Auto-calculates end date based on plan duration and start date.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, quantity, cost per unit, supplier, and low stock threshold. Validates numeric inputs and resets form on successful submission.",
  "frontend/src/components/IngredientList.tsx": "Displays ingredient inventory in a table with total value calculation, low stock warnings, and edit/delete actions. Includes confirmation dialog for deletion and integrates with EditIngredientDialog.",
  "frontend/src/components/InvoiceList.tsx": "Displays recent invoices in a table showing customer details, items, totals, payment mode, and date. Currently uses mock data with TODO comment indicating backend integration is pending.",
  "frontend/src/components/KOTPrintView.tsx": "Displays a printable Kitchen Order Ticket (KOT) view showing active subscription plans with customer details, bowl sizes, plan types, and remaining deliveries in a table format.",
  "frontend/src/components/Layout.tsx": "Main application layout component with responsive navigation sidebar, header with logo, authentication checks, and logout functionality. Redirects unauthenticated users to login page.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending bulk notifications to selected customers, displaying recipient badges and a message textarea with character count.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new salad bowl products with name, bowl type, price, and dynamic recipe ingredients list. Includes add/remove ingredient functionality.",
  "frontend/src/components/ProductList.tsx": "Displays a grid of product cards with availability toggle, edit recipe/product buttons, and delete functionality. Shows product details including name, bowl type, price, and recipe ingredients.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component displaying sales and profit data in daily (line chart), weekly (bar chart), and monthly (line chart) views using Recharts library with mock data.",
  "frontend/src/components/StockInTab.tsx": "Form component for recording incoming stock with ingredient selection, quantity, supplier, and cost price inputs; displays a table of stock-in transactions using StockTransactionTable.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording outgoing stock with ingredient selection, quantity, and reason inputs; validates sufficient stock availability and displays stock-out transactions.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, edit/delete actions, and a dialog to add new ingredients using IngredientForm.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with columns for ingredient, quantity, type badges, reason, supplier, and cost price.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating subscriptions with customer details, plan type (weekly/monthly), bowl size selection, pricing, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards in a grid with status badges (active/expired/expiring soon), customer details, and edit/delete actions with confirmation dialog.",
  "frontend/src/components/WriteOffTab.tsx": "React component for recording ingredient write-offs with form validation, stock checking, and a transaction history table displaying past write-off records.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the ICP actor instance based on Internet Identity authentication state, creating authenticated or anonymous actors and invalidating dependent queries on identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient lifecycle with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations, including analytics, products, customers, subscriptions, ingredients, stock transactions, and invoices with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using a fresh green and warm orange color palette, plus print styles for KOT (Kitchen Order Ticket) and mobile-friendly touch targets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Page component with tabs for creating new invoices and viewing invoice history, using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication guard, bulk selection, notification sending, and customer CRUD operations through CustomerList and CustomerForm components.",
  "frontend/src/pages/DashboardPage.tsx": "Dashboard page component displaying a hero banner with salad image, alert panel, dashboard metrics, and a sales/profit trends chart using Card components.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabbed interface for Stock Status, Stock In, Stock Out, and Write Off operations.",
  "frontend/src/pages/LoginPage.tsx": "Login page using Internet Identity authentication with Salad Khatora branding, redirects to dashboard after successful login.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with dialog-based form for adding new salad bowls and a list view of existing products.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page providing CSV export functionality for inventory, sales, subscriptions, and expenses with mock data placeholders for backend integration.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page with add subscription dialog, subscription list view, and KOT (Kitchen Order Ticket) print functionality.",
  "frontend/src/utils/csvExport.ts": "Utility functions for exporting sales and inventory data to CSV format with proper formatting and download handling.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme (fresh/warm palettes), OKLCH color space, extended theme settings, and animation plugins for the Salad Khatora UI.",
  "project_state.json": "Project state document tracking features, architecture, known issues (logo loading, edit/delete functionality, admin login enforcement), and comprehensive business requirements for the Salad Khatora management system."
}