{
  "backend/main.mo": "Motoko backend actor defining data types (Ingredient, SaladBowl, Invoice, Subscription, StockTransaction) and business logic for inventory management, product recipes, billing, subscriptions, and analytics with functions for stock deduction, sales calculation, and CRUD operations.",
  "feature_evidence.json": "Feature evidence report documenting two completed features: updating LoginPage component to match design mockup and implementing Internet Identity authentication styled as traditional email/password login.",
  "frontend-file-summaries.txt": "Text file containing JSON-formatted summaries of all frontend source files including pages, components, and their functionality for the Salad Khatora business management application.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, borders, charts, sidebar) using oklch color space.",
  "frontend/index.html": "HTML entry point with root div and script tag loading the React application from main.tsx.",
  "frontend/README.md": "Documentation explaining the application's Internet Identity authentication system, features (dashboard, inventory, products, billing, subscriptions, reports), technology stack, and usage instructions for first-time and returning users.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with protected and public routes, Internet Identity authentication provider, QueryClient setup, and ProtectedRoute wrapper component that redirects unauthenticated users to login with loading states.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Includes TODO comments for future backend integration and email notification features.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, product selection, quantity, pricing, and payment mode. Uses mock product data and includes TODOs for backend API integration.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with name, phone, email, address, and preferences fields. Integrates with backend using useAddCustomer hook and includes email validation.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection and individual message sending actions. Handles loading states and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Displays key business metrics (daily/weekly/monthly sales, cash flow, expenses) in card format. Fetches data using useAnalyticsMetrics hook with loading states and currency formatting.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, quantity, cost price, supplier, and low stock threshold. Uses useUpdateIngredient hook for backend updates.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl products with fields for name, bowl size, price, and active status. Handles form submission via useUpdateProduct mutation and displays validation errors.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management (add/remove/update). Converts recipe data to backend format and submits via useEditRecipe mutation.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, payment status, and date range. Auto-calculates end date based on plan duration and start date.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, quantity, cost per unit, supplier, and low stock threshold. Submits data via useAddIngredient mutation and resets form on success.",
  "frontend/src/components/IngredientList.tsx": "Displays ingredient inventory in a table with total value calculation, low stock warnings, and edit/delete actions. Includes confirmation dialog for deletions and integrates with EditIngredientDialog.",
  "frontend/src/components/InvoiceList.tsx": "Displays recent invoices in a table showing customer details, items, totals, and payment modes. Currently uses mock data with a TODO comment to integrate with backend.",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket (KOT) view displaying active subscription plans with customer details, bowl sizes, plan types, and remaining deliveries in a table format.",
  "frontend/src/components/Layout.tsx": "Main application layout component with responsive navigation, mobile menu sheet, authentication checks, and logout functionality. Redirects unauthenticated users to login page.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending bulk notifications to selected customers, displaying recipient badges and a message textarea with character count.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new salad bowl products with name, bowl type, price, and dynamic recipe ingredients list with add/remove functionality.",
  "frontend/src/components/ProductList.tsx": "Displays a grid of product cards with availability toggle, edit recipe/product dialogs, and delete confirmation. Shows product details including name, bowl type, price, and recipe ingredients.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component displaying sales and profit data in daily (line chart), weekly (bar chart), and monthly (line chart) views using Recharts with mock data.",
  "frontend/src/components/StockInTab.tsx": "Form component for recording incoming stock with ingredient selection, quantity, supplier, and cost price fields; displays a table of stock-in transactions and validates input before submission.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording outgoing stock with ingredient selection, quantity, and reason fields; validates sufficient stock availability and displays a table of stock-out transactions.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, includes add/edit/delete ingredient functionality with dialogs, and shows stock level alerts.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with formatted columns for date, ingredient, quantity, type badges, reason, supplier, and cost price.",
  "frontend/src/components/SubscriptionForm.tsx": "Form component for creating subscriptions with customer details, plan type (weekly/monthly), bowl size selection, pricing, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards in a grid layout with status badges (active/expired/expiring soon), shows remaining days and deliveries, and includes edit/delete actions with confirmation dialogs.",
  "frontend/src/components/WriteOffTab.tsx": "React component for recording ingredient write-offs with form validation, stock checking, and a transaction history table displaying past write-off records.",
  "frontend/src/hooks/useActor.ts": "Custom React hook that manages the backend actor instance with authentication, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries on actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations including analytics, products, customers, subscriptions, ingredients, stock transactions, and invoices with automatic cache invalidation.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using a fresh green and warm orange color palette for a salad business, plus print styles for KOT (Kitchen Order Tickets).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Page component with tabs for creating new invoices and viewing invoice history using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication guard, bulk selection, individual/bulk notification sending, and customer add/list functionality.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner with salad image, alert panel, metrics overview, and sales/profit trends chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with four tabs: Stock Status, Stock In, Stock Out, and Write Off for tracking ingredients and stock levels.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity integration, featuring email/password input fields (disabled) and a sign-in button that redirects to dashboard after authentication.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page for salad bowls with a dialog-based form to add new products and a list view of existing products.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page providing CSV export functionality for inventory, sales, subscriptions, and expenses reports with mock data placeholders.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page with dialog forms for adding subscriptions, a list view, and KOT (Kitchen Order Ticket) print functionality.",
  "frontend/src/utils/csvExport.ts": "Utility functions for exporting sales and inventory data to CSV files with formatted headers and downloadable blob generation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes (fresh, warm, chart colors), OKLCH color space, container settings, and animation plugins.",
  "project_state.json": "Project state file tracking a full-stack Salad Khatora business management application with inventory, billing, subscriptions, analytics dashboard, and customer management features. Documents known issues including non-functional edit/delete operations, logo loading failure, and missing authentication enforcement."
}