{
  "backend/main.mo": "Main Motoko actor implementing a salad bowl business management system with inventory, products, customers, orders, subscriptions, invoicing, and stock transactions. Includes authorization mixin, data migration support, and comprehensive CRUD operations for all business entities.",
  "backend/migration.mo": "Data migration module that recalculates nextCustomerId by finding the maximum customer ID in the existing customers map and incrementing it by 1.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: stock status filtering and highlighting, product list refresh after creation, and customer creation error resolution.",
  "frontend-file-summaries.txt": "Summaries of frontend React/TypeScript components covering authentication, dashboard, inventory, products, billing, subscriptions, reports, and customer management pages with Internet Identity integration.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark theme colors, including sidebar, chart, and UI component styling tokens.",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Documentation for the Salad Khatora business management system explaining Internet Identity authentication flow, features, technology stack, and browser compatibility requirements.",
  "frontend/src/App.tsx": "Main React application component configuring TanStack Router with admin and user routes, Internet Identity authentication, protected route wrappers, and QueryClient provider setup.",
  "frontend/src/components/AlertPanel.tsx": "Displays active alerts for low stock ingredients and expiring subscriptions using mock data. Includes TODO comments for future backend integration and email notification features.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, product selection, quantity, pricing, and payment mode. Includes auto-calculation of subtotals and totals with discount support, currently using mock product data.",
  "frontend/src/components/CartDrawer.tsx": "Side drawer component displaying shopping cart items with quantity controls, item removal, and checkout navigation. Shows empty state when cart is empty and calculates total price.",
  "frontend/src/components/CustomerForm.tsx": "Form for adding new customers with personal details, contact info, and health metrics (age, height, weight). Includes BMI calculation, field validation, and uses React Query mutation hook for backend submission.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for bulk selection and individual message sending actions. Handles loading and empty states.",
  "frontend/src/components/CustomerLoginButton.tsx": "Authentication button component that toggles between login and logout states for customers. Uses CustomerAuthContext and clears query cache on logout.",
  "frontend/src/components/CustomerProtectedRoute.tsx": "Route guard component that redirects unauthenticated users to login page and shows loading screen during authentication initialization. Protects customer-facing routes.",
  "frontend/src/components/DashboardMetrics.tsx": "Displays a grid of metric cards showing daily/weekly/monthly sales, cash flow, and daily expenses with icons and formatted currency values. Fetches analytics data using useAnalyticsMetrics hook and shows loading skeletons while data loads.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, supplier, quantity, cost price, low stock threshold, and unit type. Validates numeric inputs and calls useUpdateIngredient mutation on form submission.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl product details including name, bowl size/type, price, and active status. Uses useUpdateProduct mutation and fetches available bowl sizes for the dropdown selector.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management (add/remove ingredients). Validates that all ingredients have names and positive quantities before calling useEditRecipe mutation.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, pricing, payment status, and date range. Auto-calculates end date based on start date and plan duration (weekly/monthly).",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, supplier, quantity, cost price, low stock threshold, and unit type. Validates numeric inputs and resets form after successful submission via useAddIngredient mutation.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of ingredients with quantity, cost, supplier, and low-stock alerts. Supports editing and deleting ingredients with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Shows a table of recent invoices with customer details, items, payment mode, and date. Currently uses mock data with a TODO to integrate backend.",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket (KOT) listing active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries.",
  "frontend/src/components/Layout.tsx": "Main layout wrapper with navigation sidebar, authentication checks, and logout functionality. Redirects unauthenticated users to login and shows loading screens during initialization.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog for sending bulk notifications to selected customers. Displays recipient badges and a message textarea with character count.",
  "frontend/src/components/OrderStatusDropdown.tsx": "Dropdown select component for changing order status (pending, preparing, ready, delivered) with confirmation dialog and color-coded status badges.",
  "frontend/src/components/OrderStatusTimeline.tsx": "Visual timeline component showing order progress through four stages (placed, preparing, ready, delivered) with icons and progress indicators.",
  "frontend/src/components/ProductDetailDialog.tsx": "Dialog component displaying detailed product information including image, bowl size, price, ingredients, and quantity selector with add-to-cart functionality.",
  "frontend/src/components/ProductForm.tsx": "Form component for creating new salad bowl products with name, bowl type, price, and dynamic recipe ingredient list with validation.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit/delete actions, and dialogs for editing recipes and product details.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component showing mock sales and profit data in daily, weekly, and monthly views using line and bar charts.",
  "frontend/src/components/StockInTab.tsx": "Form for recording incoming stock with ingredient selection, quantity, supplier, and cost price fields, plus transaction history table.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording stock-out transactions with ingredient selection, quantity input, reason field, and validation against available stock. Displays a table of past stock-out transactions.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table showing ingredients with quantity > 0, total inventory value, and provides add/edit/delete actions for ingredients with confirmation dialogs.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with columns for date, ingredient, quantity, type (Stock In/Out/Write Off), reason, supplier, and cost price.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating new subscriptions with fields for customer details, plan type (weekly/monthly), bowl size, pricing, payment status, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Grid display of subscription cards showing customer details, plan info, remaining deliveries, expiry status with badges, and edit/delete actions with confirmation dialog.",
  "frontend/src/components/UserLayout.tsx": "Customer-facing layout wrapper with sticky header, navigation menu (Menu, Track Order, Dashboard), cart drawer with item count badge, and customer login button.",
  "frontend/src/components/UserMenuSection.tsx": "Displays the customer-facing menu of available salad bowls with product cards showing images, prices, and an 'Add to Cart' button. Fetches active products from the backend and handles adding items to the shopping cart with toast notifications.",
  "frontend/src/components/UserOrdersSection.tsx": "Shows a customer's order history with order details including items, delivery address, payment mode, status badges, and timestamps. Fetches orders based on the logged-in user's customer ID and displays them in expandable cards.",
  "frontend/src/components/UserProfileSection.tsx": "Provides a form for customers to view and edit their profile information including personal details, contact info, and health metrics (height, weight, BMI). Validates input fields and calculates BMI in real-time, saving changes via mutation hooks.",
  "frontend/src/components/WriteOffTab.tsx": "Admin interface for recording inventory write-offs with ingredient selection, quantity input, and reason fields. Displays a history of write-off transactions and validates stock availability before recording losses.",
  "frontend/src/contexts/CartContext.tsx": "React context provider managing shopping cart state with add, update, remove, and clear operations. Persists cart data to sessionStorage and provides cart total calculation functionality.",
  "frontend/src/contexts/CustomerAuthContext.tsx": "Authentication context wrapper for customer login using Internet Identity, providing login/logout functions and authentication status. Exposes identity state and initialization status to child components.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state. Handles actor initialization with admin tokens and invalidates dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, orders, subscriptions, ingredients, stock, and user profiles with mutations for CRUD operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette (fresh green and warm orange theme), dark mode support, mobile-friendly touch targets, and print styles optimized for kitchen order tickets.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Displays billing interface with tabs for creating new invoices and viewing invoice history using BillingForm and InvoiceList components.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles customer checkout flow with form validation for name, phone, and address, displays cart summary, and submits orders with payment mode selection.",
  "frontend/src/pages/CustomerLoginPage.tsx": "Customer-facing login page that uses Internet Identity authentication and redirects authenticated users to the dashboard with feature highlights.",
  "frontend/src/pages/CustomersPage.tsx": "Admin page for managing customers with bulk selection, individual/bulk notification sending, and add customer form. Requires Internet Identity authentication.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, metrics overview, and sales/profit chart.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Admin login page using Internet Identity for passwordless authentication with biometric support.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Order confirmation page showing order ID, estimated preparation time, and navigation to track order or return to menu.",
  "frontend/src/pages/OrdersPage.tsx": "Admin orders page displaying all orders in an expandable table with status management and order details.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Public order tracking page allowing users to search orders by phone number or order ID and view order status timeline.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with dialog for adding new salad bowls and a list view of existing products.",
  "frontend/src/pages/ReportsPage.tsx": "Displays exportable reports (inventory, sales, subscriptions, expenses) with CSV download functionality using mock data. Each report card shows an icon, description, and export button.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Manages customer subscriptions with a dialog for adding new subscriptions, a list view, and a KOT (Kitchen Order Ticket) print feature.",
  "frontend/src/pages/UserDashboardPage.tsx": "User-facing dashboard with three tabs (Profile, Menu, Orders) that render respective section components for customer self-service.",
  "frontend/src/pages/UserMenuPage.tsx": "Public menu page displaying active salad bowl products with hero banner, product cards showing images/prices, and a detail dialog for product selection.",
  "frontend/src/utils/bmiCalculator.ts": "Utility functions to calculate BMI from height/weight, categorize BMI values (Underweight/Normal/Overweight/Obese), and return appropriate color codes.",
  "frontend/src/utils/csvExport.ts": "Provides CSV export functions for sales and inventory data, formatting rows with headers and triggering browser downloads.",
  "frontend/src/utils/urlParams.ts": "URL parameter utilities supporting both regular query strings and hash-based routing, with sessionStorage persistence for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (fresh/warm themes), OKLCH color space, extended utilities, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state tracking four admin panel bugs: inventory stock status filtering/highlighting, ingredient name input field, bowl products not displaying, and customer creation errors. Contains feature definitions and pending fix requests for these issues."
}