{
  "backend/main.mo": "Motoko backend actor defining types (Ingredient, SaladBowl, Invoice, Subscription, StockTransaction, Customer) and business logic for inventory management, sales tracking, subscription handling, and analytics with functions for stock deduction, sales calculation, and period-based reporting.",
  "feature_evidence.json": "Feature evidence report documenting a request to revert the LoginPage component to Version 10 state, removing the centered card layout and modern UI elements introduced in Version 11.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend files including pages (Dashboard, Inventory, Products, Billing, Subscriptions, Reports), components (Layout, Forms, Lists, Charts), authentication setup with Internet Identity, and routing with TanStack Router.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI elements (background, foreground, primary, secondary, borders, charts, sidebar).",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/README.md": "Documentation for the Salad Khatora business management system explaining Internet Identity authentication flow, features, technology stack, and browser compatibility requirements.",
  "frontend/src/App.tsx": "Main application setup with TanStack Router configuration, QueryClient provider, InternetIdentity authentication wrapper, ProtectedRoute component for auth guards, and route definitions for all pages (login, dashboard, inventory, products, billing, subscriptions, reports, customers).",
  "frontend/src/components/AlertPanel.tsx": "Alert panel component displaying mock data for low stock ingredients and expiring subscriptions with visual indicators and badges; includes TODO comment for future email notification integration.",
  "frontend/src/components/BillingForm.tsx": "Form component for creating invoices with customer details, multiple line items, payment mode selection, and discount calculation. Currently uses mock product data with TODO comments for backend integration.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with fields for name, phone, email, address, and preferences. Uses useAddCustomer hook to persist customer data to the backend.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection and individual message send buttons. Shows loading and empty states appropriately.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and daily expenses as cards with icons. Fetches data using useAnalyticsMetrics hook.",
  "frontend/src/components/EditIngredientDialog.tsx": "Modal dialog for editing existing ingredient details including name, supplier, quantity, cost price, and low stock threshold. Uses useUpdateIngredient mutation hook.",
  "frontend/src/components/EditProductDialog.tsx": "Modal dialog for editing product (salad bowl) details including name, bowl size, price, and active status. Uses useUpdateProduct mutation and fetches available bowl sizes.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing salad bowl recipes, allowing users to add/remove ingredients with quantities and save changes via the useEditRecipe hook.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, dates, and payment status with auto-calculated end dates based on plan duration.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients with fields for name, quantity, cost, supplier, and low stock threshold, submitting via useAddIngredient hook.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of all ingredients with inventory value calculation, low stock alerts, and edit/delete actions with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Displays a table of recent invoices with mock data including customer details, items, totals, and payment modes (backend integration pending).",
  "frontend/src/components/KOTPrintView.tsx": "Renders a printable Kitchen Order Ticket showing active subscription plans with customer names, bowl sizes, and remaining deliveries in a formatted table.",
  "frontend/src/components/Layout.tsx": "Main layout component with navigation header, sidebar menu, and authentication-based routing. Includes mobile menu support and logout functionality using Internet Identity.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending bulk notifications to selected customers. Displays recipient badges and a message textarea with character count.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new salad bowl products with name, bowl type, price, and dynamic recipe ingredients list. Includes add/remove ingredient functionality.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit recipe/product, and delete functionality. Uses React Query hooks for CRUD operations on salad bowls.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component displaying sales and profit data in daily, weekly, and monthly views using Recharts. Currently uses mock data pending backend integration.",
  "frontend/src/components/StockInTab.tsx": "Form and table for recording incoming inventory stock with ingredient selection, quantity, supplier, and cost price. Displays historical stock-in transactions.",
  "frontend/src/components/StockOutTab.tsx": "Form component for recording stock-out transactions with ingredient selection, quantity input, and reason field; displays a table of past stock-out transactions and validates sufficient stock before submission.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current inventory status in a table with total value calculation, low-stock alerts, and actions to add, edit, or delete ingredients; includes dialogs for ingredient management.",
  "frontend/src/components/StockTransactionTable.tsx": "Reusable table component that displays stock transactions sorted by date with formatted timestamps, transaction type badges, and details like ingredient, quantity, supplier, and cost price.",
  "frontend/src/components/SubscriptionForm.tsx": "Form for creating new subscriptions with customer details, plan type (weekly/monthly), bowl size selection, pricing, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Displays subscription cards in a grid with status badges (active/expired/expiring soon), customer details, remaining deliveries, and actions to edit or delete subscriptions.",
  "frontend/src/components/WriteOffTab.tsx": "Form component for recording inventory write-offs with ingredient selection, quantity input, and reason field; displays a table of past write-off transactions and validates stock availability.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and manages an authenticated or anonymous actor for backend communication, invalidating dependent queries when the actor changes based on Internet Identity authentication state.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login/logout state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for data fetching and mutations covering analytics, products, customers, subscriptions, recipes, ingredients, stock transactions, and invoices with toast notifications.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables for light/dark themes using a fresh green and warm orange color palette, plus mobile-friendly touch targets and print styles for KOT (Kitchen Order Tickets).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Billing page with tabs for creating new invoices and viewing invoice history, using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication guard, supporting bulk selection, individual/bulk notifications, and adding new customers via CustomerForm.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, business metrics, and sales/profit trend charts.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Login page that triggers Internet Identity authentication and redirects to dashboard upon successful login.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with a dialog to add new salad bowls via ProductForm and displays existing products using ProductList component.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page that exports inventory, sales, subscriptions, and expenses data to CSV files with mock data placeholders for backend integration.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page with dialog for adding subscriptions and a print KOT (Kitchen Order Ticket) feature for subscription orders.",
  "frontend/src/utils/csvExport.ts": "Utility functions to export sales and inventory data to CSV files with formatted headers and downloadable blob creation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color schemes (fresh, warm), OKLCH color system, container settings, and animation keyframes for the UI.",
  "project_state.json": "Project metadata tracking features, architecture, and known issues including non-functional edit/delete operations for products and inventory, missing logo, and authentication flow problems."
}