{
  "backend/main.mo": "Main Motoko actor defining types (Ingredient, SaladBowl, Invoice, Subscription, StockTransaction, Customer) and business logic for inventory management, sales, subscriptions, and analytics with stable storage maps and helper functions for calculations and deductions.",
  "feature_evidence.json": "Feature evidence report documenting two implemented features: Internet Identity authentication protection for CustomersPage route and conditional sidebar navigation display based on authentication state.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including pages, components, hooks, and utilities for the Salad Khatora application with routing, authentication, and business features.",
  "frontend/index.css": "Tailwind CSS configuration with custom CSS variables for light and dark themes defining colors for UI components (background, foreground, primary, secondary, sidebar, charts, etc.).",
  "frontend/index.html": "HTML entry point for the React application with root div and module script reference to main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with routes for all pages (dashboard, login, inventory, products, billing, subscriptions, reports, customers), React Query client, Internet Identity provider, and toast notifications.",
  "frontend/src/components/AlertPanel.tsx": "Alert panel component displaying mock low stock warnings and expiring subscription notifications with badges and icons; includes TODO for future email notification integration.",
  "frontend/src/components/BillingForm.tsx": "Invoice creation form with customer details, dynamic product line items with auto-filled prices from available products list, quantity management, discount calculation, and subtotal/total computation.",
  "frontend/src/components/CustomerForm.tsx": "Form component for adding new customers with fields for name, phone, email, address, and preferences. Includes email validation and uses the useAddCustomer hook to persist data.",
  "frontend/src/components/CustomerList.tsx": "Table component displaying customer list with checkboxes for selection and individual message send buttons. Handles loading states and empty states.",
  "frontend/src/components/DashboardMetrics.tsx": "Dashboard metrics display showing daily/weekly/monthly sales, cash flow, and daily expenses in card format. Fetches data using useAnalyticsMetrics hook and formats currency in Indian Rupees.",
  "frontend/src/components/EditIngredientDialog.tsx": "Dialog component for editing existing ingredient details including name, quantity, cost price, supplier, and low stock threshold. Uses useUpdateIngredient hook for persistence.",
  "frontend/src/components/EditProductDialog.tsx": "Dialog component for editing salad bowl product details including name, bowl size/type, price, and active status. Uses useUpdateProduct hook and fetches available bowl sizes.",
  "frontend/src/components/EditRecipeDialog.tsx": "Dialog component for editing product recipes with dynamic ingredient list management (add/remove ingredients with quantities). Uses useEditRecipe hook to save recipe changes.",
  "frontend/src/components/EditSubscriptionDialog.tsx": "Dialog component for editing subscription details including customer info, plan type, bowl size, pricing, payment status, and date range with auto-calculation of end dates based on plan duration.",
  "frontend/src/components/IngredientForm.tsx": "Form component for adding new ingredients to inventory with fields for name, quantity, cost per unit, supplier, low stock threshold, and unit type.",
  "frontend/src/components/IngredientList.tsx": "Displays a table of all ingredients with total inventory value, low stock warnings, and actions for editing/deleting ingredients with confirmation dialogs.",
  "frontend/src/components/InvoiceList.tsx": "Displays a table of recent invoices with mock data showing customer details, items, totals, payment modes, and dates (backend integration pending).",
  "frontend/src/components/KOTPrintView.tsx": "Generates a printable Kitchen Order Ticket (KOT) view listing all active subscription plans with customer names, bowl sizes, plan types, and remaining deliveries.",
  "frontend/src/components/Layout.tsx": "Main application layout component with responsive navigation header, mobile menu drawer, authentication-aware nav items, and logout functionality.",
  "frontend/src/components/NotificationDialog.tsx": "Dialog component for sending bulk notifications to selected customers with message input, recipient badges, and simulated send functionality.",
  "frontend/src/components/ProductForm.tsx": "Form component for adding new salad bowl products with name, bowl type, price, and dynamic recipe ingredients list with add/remove functionality.",
  "frontend/src/components/ProductList.tsx": "Displays grid of product cards with availability toggle, edit/delete actions, and dialogs for editing recipes and product details.",
  "frontend/src/components/SalesChart.tsx": "Tabbed chart component displaying mock sales and profit data in daily, weekly, and monthly views using line and bar charts.",
  "frontend/src/components/StockInTab.tsx": "Form for recording incoming stock with ingredient selection, quantity, supplier, cost price inputs, and displays stock-in transaction history.",
  "frontend/src/components/StockOutTab.tsx": "Form for recording stock removal with ingredient selection, quantity, reason inputs, validates available stock, and displays stock-out transaction history.",
  "frontend/src/components/StockStatusTab.tsx": "Displays current stock status with total inventory value, a table of ingredients showing quantity/cost/status, and provides add/edit/delete functionality for ingredients via dialogs.",
  "frontend/src/components/StockTransactionTable.tsx": "Renders a sortable table of stock transactions (Stock In, Stock Out, Write Off) with date formatting, transaction type badges, and displays ingredient, quantity, supplier, and cost details.",
  "frontend/src/components/SubscriptionForm.tsx": "Form component for creating new subscriptions with fields for customer details, plan type (weekly/monthly), bowl size, pricing, payment status, and auto-calculated end dates based on plan duration.",
  "frontend/src/components/SubscriptionList.tsx": "Displays all subscriptions as cards showing customer info, plan details, remaining deliveries, expiry status with badges, and provides edit/delete actions with confirmation dialog.",
  "frontend/src/components/WriteOffTab.tsx": "Provides a form to record ingredient write-offs with quantity validation against available stock, reason input, and displays historical write-off transactions in a table.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance based on Internet Identity authentication state, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend data operations including analytics, products, customers, subscriptions, recipes, inventory, and invoices with mutations for CRUD operations.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom color palette for a salad business theme (fresh greens, warm oranges), dark mode support, and print styles for KOT (Kitchen Order Ticket).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/pages/BillingPage.tsx": "Billing page with tabs for creating new invoices and viewing invoice history, using BillingForm and InvoiceList components.",
  "frontend/src/pages/CustomersPage.tsx": "Customer management page with authentication guard, bulk selection for notifications, add customer form, and customer list with individual messaging capabilities.",
  "frontend/src/pages/DashboardPage.tsx": "Main dashboard page displaying a hero banner, alert panel, business metrics, and sales/profit trend charts.",
  "frontend/src/pages/InventoryPage.tsx": "Inventory management page with tabs for stock status, stock in, stock out, and write-off operations.",
  "frontend/src/pages/LoginPage.tsx": "Login page with Internet Identity authentication, featuring branded UI and automatic redirect to dashboard after successful login.",
  "frontend/src/pages/ProductsPage.tsx": "Product management page with a dialog to add new salad bowls via ProductForm and displays existing products using ProductList component.",
  "frontend/src/pages/ReportsPage.tsx": "Reports page that exports inventory, sales, subscriptions, and expenses data to CSV files with mock data placeholders for backend integration.",
  "frontend/src/pages/SubscriptionsPage.tsx": "Subscription management page with add subscription dialog, subscription list display, and KOT (Kitchen Order Ticket) print functionality.",
  "frontend/src/utils/csvExport.ts": "Utility functions to export sales and inventory data to CSV files with formatted headers and downloadable blob creation.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color palette (fresh, warm themes), OKLCH color space, extended utilities, and animation keyframes for accordion components.",
  "project_state.json": "Project metadata tracking architectural decisions, implemented features (billing, analytics, subscriptions, alerts, reports), known issues (logo loading, edit/delete functionality), and feature requirements mapping."
}