{
  "kind": "build_request",
  "title": "Fix admin panel issues in inventory, products, and customers",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "In the Inventory tab Stock Status view, display only ingredients that have stock available (quantity > 0). Highlight rows where stock is below the low stock threshold.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "stock status should show only the stock available with low stock highlight"
        ]
      },
      "acceptanceCriteria": [
        "Stock Status table filters out ingredients with zero quantity",
        "Ingredients below low stock threshold are visually highlighted (e.g., different background color or border)",
        "The total value calculation reflects only available stock"
      ]
    },
    {
      "id": "REQ-2",
      "text": "In the Inventory tab Stock In form, fix the ingredient name input field so users can type and select ingredient names properly.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "In stock in not able to write ingredient name"
        ]
      },
      "acceptanceCriteria": [
        "Ingredient name input field is editable and accepts text input",
        "Users can select ingredients from the dropdown",
        "Selected ingredient populates correctly in the form"
      ]
    },
    {
      "id": "REQ-3",
      "text": "In the Products tab, ensure that newly added bowl products appear in the product list immediately after creation.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "In products after adding bowl it is not displayed"
        ]
      },
      "acceptanceCriteria": [
        "After successfully submitting the product form, the new product appears in the product list",
        "The product list refreshes automatically after product creation",
        "Product data persists and is retrievable from backend"
      ]
    },
    {
      "id": "REQ-4",
      "text": "In the Customers tab, resolve the 'Failed to add customer' error that occurs when attempting to add new customers. Investigate and fix the backend customer creation logic and frontend error handling.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-7"
        ],
        "quotes": [
          "In customers tab while adding customer showing error failed to add customer"
        ]
      },
      "acceptanceCriteria": [
        "Customer form successfully submits without errors",
        "New customers are persisted to backend storage",
        "Newly added customers appear in the customer list",
        "Appropriate error messages are displayed if validation fails"
      ]
    }
  ],
  "constraints": [
    "Maintain the existing single-actor backend architecture",
    "Do not modify immutable frontend paths: useInternetIdentity hooks, useActor.ts, main.tsx, or components/ui directory"
  ],
  "nonGoals": [
    "Redesigning the admin panel UI layout",
    "Adding new features beyond fixing the reported issues",
    "Changing the authentication system"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}