{
  "kind": "build_request",
  "title": "Update Admin Panel Login UI to Match New Design",
  "projectName": "Salad Khatora",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-85",
      "text": "Update the LoginPage component (frontend/src/pages/LoginPage.tsx) to match the uploaded design mockup. Replace the existing layout with a centered card design featuring the Salad Khatora logo at the top, 'Admin Panel Login' heading, 'Secure authentication for administrative access' subtitle, and three feature sections with icons and descriptions: 'Secure Authentication' (Login with Internet Identity for maximum security), 'No Passwords' (Passwordless authentication using cryptographic keys), and 'Biometric Support' (Use fingerprint or face recognition on supported devices). Add the text 'By logging in, you agree to use this admin panel responsibly' at the bottom.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-deploy-again"
        ],
        "quotes": [
          "deploy again"
        ]
      },
      "acceptanceCriteria": [
        "The LoginPage displays the Salad Khatora logo centered at the top",
        "The heading 'Admin Panel Login' is displayed below the logo",
        "The subtitle 'Secure authentication for administrative access' appears below the heading",
        "Three feature sections are displayed with shield, lock, and fingerprint icons",
        "Each feature section shows the title and description as shown in the mockup",
        "The disclaimer text 'By logging in, you agree to use this admin panel responsibly' appears at the bottom",
        "The Internet Identity login functionality remains functional",
        "The layout is responsive and works on mobile devices"
      ]
    },
    {
      "id": "REQ-86",
      "text": "Maintain the existing Internet Identity authentication integration in the LoginPage component. Ensure that clicking the login button or area triggers the Internet Identity authentication flow using the useInternetIdentity hook, and successfully authenticated users are redirected to the admin dashboard.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-deploy-again"
        ]
      },
      "acceptanceCriteria": [
        "The Internet Identity login flow is triggered when the user attempts to log in",
        "Successful authentication redirects users to the admin dashboard",
        "The authentication state is properly managed using the existing useInternetIdentity hook",
        "No authentication functionality is broken by the UI changes"
      ]
    }
  ],
  "constraints": [
    "Do not modify the authentication logic or useInternetIdentity hook implementation",
    "Maintain compatibility with the existing Layout component and routing structure",
    "Do not change the backend authentication system"
  ],
  "nonGoals": [
    "Adding actual email/password authentication",
    "Modifying the admin panel features or functionality",
    "Changing the customer-facing login page",
    "Adding new authentication methods"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}