{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Restore Version 22 Features",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Remove customer reference field from frontend forms and displays",
      "acceptanceCriteria": [
        "Customer records no longer include a reference field",
        "CustomerForm does not display or accept a reference field",
        "CustomerList does not show the reference column"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/CustomerForm.tsx",
          "operation": "modify",
          "description": "Remove the reference field input from the customer form component. Remove any state management, validation, or form submission logic related to the reference field."
        },
        {
          "path": "frontend/src/components/CustomerList.tsx",
          "operation": "modify",
          "description": "Remove the reference column from the customer list table. Remove the table header and corresponding data cell that displays customer reference values."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Remove audible order notification system from the frontend",
      "acceptanceCriteria": [
        "useOrderNotifications hook is removed or disabled",
        "No audio alert plays when new orders arrive",
        "Order polling functionality is removed from the Layout component"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useOrderNotifications.ts",
          "operation": "delete",
          "description": "Delete the useOrderNotifications hook that polls for new orders and plays audio alerts."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Remove the useOrderNotifications hook import and invocation from the Layout component. Remove any UI elements or logic that depend on order notifications."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Remove UPI QR code generation from billing system",
      "acceptanceCriteria": [
        "BillingForm no longer displays UPI QR codes",
        "UPIQRCode component is not rendered in billing flow",
        "Payment mode selection does not trigger QR code generation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/BillingForm.tsx",
          "operation": "modify",
          "description": "Remove UPIQRCode component import and rendering from the billing form. Remove any state management, conditional logic, or event handlers related to UPI QR code generation."
        },
        {
          "path": "frontend/src/components/UPIQRCode.tsx",
          "operation": "delete",
          "description": "Delete the UPIQRCode component that generates and displays UPI payment QR codes."
        },
        {
          "path": "frontend/src/utils/upiQRGenerator.ts",
          "operation": "delete",
          "description": "Delete the utility module that generates UPI payment URLs for QR codes."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Restore inventory navigation and routes to the application",
      "acceptanceCriteria": [
        "Inventory link appears in the sidebar navigation",
        "Inventory page route is accessible at /admin/inventory",
        "Navigation includes all inventory management functionality"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Add an Inventory navigation link to the sidebar that routes to /admin/inventory. Place it in the appropriate position within the existing navigation structure."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a route for /admin/inventory that renders the InventoryPage component. Import the InventoryPage and register it in the router configuration."
        },
        {
          "path": "frontend/src/pages/InventoryPage.tsx",
          "operation": "modify",
          "description": "Implement the InventoryPage component with tabs for stock status, stock-in transactions, stock-out transactions, and write-offs. Wire in the stock management components (StockStatusTab, StockInTab, StockOutTab, WriteOffTab) and ensure proper layout and navigation."
        },
        {
          "path": "frontend/src/components/StockStatusTab.tsx",
          "operation": "modify",
          "description": "Implement the StockStatusTab component to display current inventory levels using the getInventoryStatus backend capability. Show ingredient names, quantities, unit types, stock status indicators, and low stock warnings."
        },
        {
          "path": "frontend/src/components/StockInTab.tsx",
          "operation": "modify",
          "description": "Implement the StockInTab component with a form to record stock-in transactions including ingredient selection, quantity, supplier name, cost price, and reason. Use the recordStockTransaction backend capability with stockIn transaction type."
        },
        {
          "path": "frontend/src/components/StockOutTab.tsx",
          "operation": "modify",
          "description": "Implement the StockOutTab component with a form to record stock-out transactions including ingredient selection, quantity, and reason. Use the recordStockTransaction backend capability with stockOut transaction type."
        },
        {
          "path": "frontend/src/components/WriteOffTab.tsx",
          "operation": "modify",
          "description": "Implement the WriteOffTab component with a form to record write-off transactions including ingredient selection, quantity, and reason for write-off. Use the recordStockTransaction backend capability with writeOff transaction type."
        },
        {
          "path": "frontend/src/components/StockTransactionTable.tsx",
          "operation": "modify",
          "description": "Implement the StockTransactionTable component to display a history of all stock transactions. Fetch data using getAllStockTransactions backend capability and display transaction ID, date, ingredient, type, quantity, supplier, cost price, and reason in a sortable table."
        },
        {
          "path": "frontend/src/components/IngredientForm.tsx",
          "operation": "modify",
          "description": "Implement the IngredientForm component for adding new ingredients with fields for name, unit type, low stock threshold, supplier name, initial quantity, and cost price per unit. Use the addIngredient backend capability."
        },
        {
          "path": "frontend/src/components/IngredientList.tsx",
          "operation": "modify",
          "description": "Implement the IngredientList component to display all ingredients in a table showing name, quantity, unit type, supplier, cost price, and low stock threshold. Include edit and delete functionality using updateIngredient and deleteIngredient backend capabilities."
        },
        {
          "path": "frontend/src/components/EditIngredientDialog.tsx",
          "operation": "modify",
          "description": "Implement the EditIngredientDialog component as a modal dialog for editing existing ingredient details. Pre-populate fields with current values and submit updates using the updateIngredient backend capability."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for inventory management operations: useGetAllIngredients, useAddIngredient, useUpdateIngredient, useDeleteIngredient, useGetInventoryStatus, useGetAllStockTransactions, and useRecordStockTransaction. Include proper error handling and toast notifications."
        }
      ]
    }
  ]
}