{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Implement edit and delete functionality for inventory items",
  "requirements": [
    {
      "id": "REQ-27",
      "summary": "Implement edit functionality for inventory items allowing modification of ingredient details including name, quantity, unit type, cost price, supplier name, and low stock threshold",
      "acceptanceCriteria": [
        "An edit button or icon appears for each ingredient in the IngredientList component",
        "Clicking edit opens a dialog with pre-populated fields for the selected ingredient",
        "All ingredient fields are editable: name, quantity, unit type, cost price, supplier, and low stock threshold",
        "Changes are validated before submission",
        "Backend provides an update method for modifying ingredient records",
        "UI updates immediately after successful edit using React Query invalidation",
        "User receives confirmation feedback when edit is successful"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditIngredientDialog.tsx",
          "operation": "create",
          "description": "Create a dialog component for editing existing ingredients, following the same pattern as EditProductDialog.tsx. Include form fields for name, quantity, unit type, cost price, supplier name, and low stock threshold. Pre-populate fields with current ingredient data. Use the updateIngredientMutation from useQueries.ts to submit changes and handle validation errors."
        },
        {
          "path": "frontend/src/components/IngredientList.tsx",
          "operation": "modify",
          "description": "Add edit button/icon to each ingredient row in the table. Import and integrate the EditIngredientDialog component. Pass the selected ingredient data to the dialog when the edit button is clicked. Maintain existing table structure and styling while adding edit action buttons alongside existing delete placeholders."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useUpdateIngredient mutation hook that calls the backend updateIngredient method. Include onSuccess callback to invalidate the ingredients query cache and show success toast notification. Follow the same pattern as useUpdateProduct and other mutation hooks in this file."
        }
      ]
    },
    {
      "id": "REQ-28",
      "summary": "Implement delete functionality for inventory items with confirmation dialog to prevent accidental deletion",
      "acceptanceCriteria": [
        "A delete button or icon appears for each ingredient in the IngredientList component",
        "Clicking delete shows a confirmation dialog before proceeding",
        "Confirmation dialog displays the ingredient name being deleted",
        "Backend provides a delete method for removing ingredient records by ID",
        "Ingredient is removed from the list immediately after successful deletion using React Query invalidation",
        "User receives confirmation feedback when deletion is successful",
        "Total inventory value recalculates automatically after deletion"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/IngredientList.tsx",
          "operation": "modify",
          "description": "Add delete button/icon to each ingredient row. Implement confirmation dialog using AlertDialog from shadcn/ui that displays the ingredient name before deletion, following the same pattern as SubscriptionList.tsx. Wire the delete button to trigger the useDeleteIngredient mutation. Ensure the total inventory value calculation updates automatically after successful deletion by relying on React Query cache invalidation."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add useDeleteIngredient mutation hook that calls the backend deleteIngredient method with the ingredient name. Include onSuccess callback to invalidate the ingredients query cache and show success toast notification. Follow the same pattern as useDeleteProduct and useDeleteSubscription mutation hooks."
        }
      ]
    }
  ]
}